# Titanic

![Titanic Image](./images/titanic.jpg)

## Short Summary

* Our problem requires classification algorithms to solve(mainly).
* There are some missing data which needs to be handled properly as this can add huge impact to our classification model.

## Problem Description

Our task is to figure out the right model for survival prediciton.

In [1]:
%ls ".\titanic\"

 Volume in drive J is Interview Preparation
 Volume Serial Number is C8B8-1379

 Directory of J:\Machine learning\Model and Analytics\Titanic\titanic

11/18/2020  08:30 AM    <DIR>          .
11/18/2020  08:30 AM    <DIR>          ..
12/11/2019  02:17 AM             3,258 gender_submission.csv
12/11/2019  02:17 AM            28,629 test.csv
12/11/2019  02:17 AM            61,194 train.csv
               3 File(s)         93,081 bytes
               2 Dir(s)  107,042,594,816 bytes free

In [2]:
import os
import pandas as pd
import seaborn as sns
sns.set_style('whitegrid')
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [3]:
DATA_PATH = os.path.join('.','titanic/')

In [4]:
train_data = pd.read_csv(DATA_PATH+'train.csv')
train_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
test_data = pd.read_csv(DATA_PATH+'test.csv')
test_data.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## Removing the PassengerID as it seems to be irrelevant for now. In the part of classification.

In [6]:
test_data.drop('PassengerId',axis=1,inplace=True)
train_data.drop('PassengerId',axis=1,inplace=True)

## Some basic statistical review to the data

### Train Data

In [7]:
train_data.describe(include='O').T

         count unique                                              top freq
Name       891    891  Stephenson, Mrs. Walter Bertram (Martha Eustis)    1
Sex        891      2                                             male  577
Ticket     891    681                                             1601    7
Cabin      204    147                                               G6    4
Embarked   889      3                                                S  644

In [8]:
train_data.describe().T

          count       mean        std   min      25%      50%   75%       max
Survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
Pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
Age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
SibSp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
Parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
Fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

### Test Data

In [9]:
test_data.describe(include='O').T

         count unique               top freq
Name       418    418  Ilieff, Mr. Ylio    1
Sex        418      2              male  266
Ticket     418    363          PC 17608    5
Cabin       91     76   B57 B59 B63 B66    3
Embarked   418      3                 S  270

In [10]:
test_data.describe().T

        count       mean        std   min      25%      50%   75%       max
Pclass  418.0   2.265550   0.841838  1.00   1.0000   3.0000   3.0    3.0000
Age     332.0  30.272590  14.181209  0.17  21.0000  27.0000  39.0   76.0000
SibSp   418.0   0.447368   0.896760  0.00   0.0000   0.0000   1.0    8.0000
Parch   418.0   0.392344   0.981429  0.00   0.0000   0.0000   0.0    9.0000
Fare    417.0  35.627188  55.907576  0.00   7.8958  14.4542  31.5  512.3292

### Comment 

* **Train Data**
    * In train data there is more count of male than female.
    
* **Test Data**
    * In test data there is